package com.company;

public class Main {

    public static void main(String[] args) {

        Cat cat=new Cat("Murzik",4);
        Dog dog=new Dog();

        cat.swim(100);
        cat.run(300);
        dog.run(1000);
        dog.swim(10);

      /*  //Заполните массив случайным числами и выведите максимальное, минимальное и среднее значение.

       int n=100;
        double  [] arr=new double [n];
        for(int i=0;i<arr.length;i++){
            arr[i]= Math.random();
        }

        double  min=arr[0];
        double  max=arr[0];
        double  averege=0;

       for (int i=0;i<arr.length;i++){
           if (arr[i]<=min){
               arr[i]=min;
           }
           if (arr[i]>= max){
               arr[i]=max;
               averege+=arr[i]/arr.length;
           }

           System.out.println("max="+max);
           System.out.println("min="+min);
           System.out.println("averege="+averege);

       }
        //Напишите программу, которая выводит на консоль простые числа в промежутке от [2, 100].


        int []arr={4,5,8,2,3,5,100,85,25,96,32,854,854,774,741,266,3,69};
        for (int i=2;i<arr.length;i++){
           if (arr[i]<=100){
               System.out.println(arr[i]);
           }
        }*/
        //Дан массив целых чисел и ещё одно целое число. Удалите все вхождения этого числа из массива



        }







    }

